updated flowchart README
